Public Attributes | List of all members
API_GridMeshLine Struct Reference
Element Manager API
Describes a grid line of the mesh. More...
#include <APIdefs_Base.h>
 Public Attributes
API_GridMeshHead  | head
Identifies the mesh element.
API_GridElemID  | begID
The identifier of begpoint vertices.
API_GridElemID  | endID
The identifier of endpoint vertices.
UInt32  | userData
Custom value assigned to this mesh line.
bool  | mainDir
If false then secondary direction.
Detailed Description
Describes a grid line of the mesh.
Member Data Documentation
◆ begID
 API_GridMeshLine::begID
The identifier of begpoint vertices.
◆ endID
 API_GridMeshLine::endID
The identifier of endpoint vertices.
◆ head
 API_GridMeshLine::head
Identifies the mesh element.
◆ mainDir
 API_GridMeshLine::mainDir
If false then secondary direction.
◆ userData
 API_GridMeshLine::userData
Custom value assigned to this mesh line.